In [ ]:
import numpy as np
import pandas as pd

In [17]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
              index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.077478 -0.557233 -0.401318
Ohio   -2.073225 -0.463846  0.403911
Texas  -0.037604  1.344627 -0.714817
Oregon -1.114915  0.124253  0.156123

In [18]:
np.abs(frame)

               b         d         e
Utah    0.077478  0.557233  0.401318
Ohio    2.073225  0.463846  0.403911
Texas   0.037604  1.344627  0.714817
Oregon  1.114915  0.124253  0.156123

In [25]:
f = lambda x: x.max() - x.min()
frame.apply(f,axis='rows')

b    2.035621
d    1.901861
e    1.118727
dtype: float64

In [21]:
frame.apply(f, axis='columns')

Utah      0.479756
Ohio      2.477136
Texas     2.059444
Oregon    1.271038
dtype: float64

In [26]:
(40/50)*100

80.0

In [29]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
             index=['three', 'one'],
             columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [30]:
 frame.sort_index()   # Index representing rows (By-default).

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [31]:
 frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [32]:
 frame.sort_index(axis=1)   # Index representing the columns.  (axis=1).

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [38]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [39]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [41]:
frame.sort_values(by='a')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [42]:
frame1

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [43]:
frame2 = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame2

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [44]:
frame2.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [ ]:
       b     a
0      4     0
1      7     1
2     -3     0
3      2     1

In [ ]:
       b     a
 2    -3     0
 3     2     1
 0     4     0
 1     7     1

In [48]:
print(frame2)                        # Sorting is according to Combination of both the columns.
frame2.sort_values(by=['a', 'b'])

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [ ]:
2   (-3,0)
0   (4,0)
3   (2,1)
1   (7,1)

In [49]:
frame2.sort_values(by=['b', 'a'])   index=['b','a','d','c']   index=['a','b','c','d']

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [ ]:
1    3    5    7    8      9      10
4    9    14   21   29     38      48